"""
Напишите программу добавляющую в рецепт бутерброда ингридиенты "Салат" и "Ананасы" с помощью декораторов.
"""
def add(func):
    def wrapper():

        func()
        list_igred
        print('Pinapple', 'Salat')

    return wrapper

@add
def recipe_of_dishes():
    a = input('Рецепт вашего бутерброда: ')
    list_igrid = list()


recept()